[
    {
        "_id": "2894",
        "intermediary_question": "Who is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_A> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2847",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_A> <dbr_C>  . }",
        "datalog_query": "ans(count) :- <dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "144",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_C>(x,uri),<dbo_C>(uri)."
    },
    {
        "_id": "841",
        "intermediary_question": "How many <A> are there of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(\"dbr_D\",x),<dbo_A>(x,uri)."
    },
    {
        "_id": "1128",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "151",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "1590",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3008",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2029",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_C> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_A>(x,\"dbr_C\")."
    },
    {
        "_id": "1807",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3289",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,x),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "279",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbp_A> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_A>(\"dbr_C\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2886",
        "intermediary_question": "What is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_A\")."
    },
    {
        "_id": "1941",
        "intermediary_question": "How many other <A> are there of the <B> whose <A> is <C> ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_C> . ?x <dbp_A> ?uri }",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_C\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "100",
        "intermediary_question": "Give me the total number of <A> of the <B> whose <A> is <C>.",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_C> . ?x <dbo_A> ?uri }",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_C\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "2804",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_B>(uri,\"dbr_C\"),<dbo_B>(uri)."
    },
    {
        "_id": "3570",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_C> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_A>(x,\"dbr_C\")."
    },
    {
        "_id": "3794",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "1096",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_A>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "829",
        "intermediary_question": "Count the number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "2767",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3295",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_C>(\"dbr_B\",x)."
    },
    {
        "_id": "2194",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbo_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "3425",
        "intermediary_question": "What are the other <A> of the <B> whose <C> is <D>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "999",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "3653",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_C> <dbr_C> . ?uri <dbo_C> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbo_C>(uri,\"dbr_D\"),<dbo_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "2483",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_C> . ?uri <dbo_A> <dbr_B> . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_B\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "4076",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "33",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3789",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_A> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_A>(\"dbr_D\",x)."
    },
    {
        "_id": "1020",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "1647",
        "intermediary_question": "What is the <A> of <B> ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri } ",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "1620",
        "intermediary_question": "What is the <A> of the <B> who is the <B> of <C> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbo_B> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_B>(\"dbr_C\",x)."
    },
    {
        "_id": "3135",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_C> <dbo_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_B\",uri),<dbo_A>(\"dbr_C\",uri)."
    },
    {
        "_id": "2689",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_D> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_D>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "297",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3774",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3276",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_C> <dbp_B> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_C\",uri),<dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "3230",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "2754",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_B\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "633",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbp_C>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4077",
        "intermediary_question": "How many <A> of the <B> whose <C> is <D>, are there ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "1321",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2016",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "426",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_A> ?x . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(x,uri),<dbp_A>(\"dbr_D\",x)."
    },
    {
        "_id": "626",
        "intermediary_question": "How many other <A> of the <B> whose <A> is <C> are there?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_C> . ?x <dbp_A> ?uri }",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_C\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "1739",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "2480",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_B> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbp_C>(x,\"dbr_B\")."
    },
    {
        "_id": "2584",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_B> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_B>(\"dbr_D\",x)."
    },
    {
        "_id": "3248",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1491",
        "intermediary_question": "Count the number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "3936",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_C>(x,uri)."
    },
    {
        "_id": "1210",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_A> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,x),<dbo_C>(x,\"dbr_A\")."
    },
    {
        "_id": "3268",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbo_D>(x,uri)."
    },
    {
        "_id": "1934",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbo_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "3064",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_C> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbp_B>(x,\"dbr_C\"),<dbp_B>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "657",
        "intermediary_question": "Who is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4264",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_E> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_E>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "132",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_C> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_A>(x,\"dbr_C\")."
    },
    {
        "_id": "471",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_C>(uri)."
    },
    {
        "_id": "4692",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "2312",
        "intermediary_question": "What is the <A> of the <B> and <A> of the <C>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbo_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_C\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "1803",
        "intermediary_question": "Count the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbp_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_A>(uri,x),<dbo_A>(uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "2642",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "3044",
        "intermediary_question": "Whose <A> are <B> and <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_B> . ?uri <dbp_B> <dbr_C> . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_C\"),<dbp_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "977",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "2417",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "505",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "4255",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_C> <dbo_A> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_A>(\"dbr_C\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "414",
        "intermediary_question": "Who is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "1183",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_C> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_C\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "2221",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "2187",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_A> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_A>(\"dbr_D\",x)."
    },
    {
        "_id": "3036",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1272",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_D> ?uri. <dbr_D> <dbo_C> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbp_D>(\"dbr_B\",uri)."
    },
    {
        "_id": "290",
        "intermediary_question": "What are the <A> of <B> ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri } ",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "252",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_A> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_A>(\"dbr_D\",x),<dbo_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "422",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(\"dbr_D\",x),<dbp_A>(x,uri)."
    },
    {
        "_id": "670",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_A> ?x  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(uri,x)."
    },
    {
        "_id": "3945",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_B> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_B>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "3523",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_C> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x,\"dbr_C\"),<dbo_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "1541",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,x),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3235",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "4310",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1550",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbp_D> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_D>(uri,x),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "1242",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2450",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(count) :- <dbo_D>(x,\"dbr_D\"),<dbo_A>(uri,x)."
    },
    {
        "_id": "859",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_B> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_B>(\"dbr_D\",x)."
    },
    {
        "_id": "1632",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_A> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_A>(x,\"dbr_A\")."
    },
    {
        "_id": "3860",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "787",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbp_A>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "2605",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_C> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbp_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "3630",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "1874",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "2882",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(x,uri),<dbp_B>(x,\"dbr_D\")."
    }
]