[
    {
        "_id": "3521",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_C> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbp_C>(x,\"dbr_C\")."
    },
    {
        "_id": "2248",
        "intermediary_question": "What is the total number of <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbp_D> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbp_C>(uri,\"dbr_C\"),<dbp_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "3562",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_B> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_C>(x,\"dbr_B\")."
    },
    {
        "_id": "2854",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "186",
        "intermediary_question": "What are the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_A> <dbr_B> . ?uri <dbp_A> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,\"dbr_D\"),<dbp_A>(uri,\"dbr_B\")."
    },
    {
        "_id": "3776",
        "intermediary_question": "What is the total number of <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbo_E> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbo_A>(uri,\"dbr_C\"),<dbo_E>(uri,\"dbr_E\")."
    },
    {
        "_id": "1599",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_A> ?uri. <dbr_D> <dbp_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_D\",uri),<dbo_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "3629",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_D>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_D\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3982",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbp_C>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3088",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_D> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_D>(uri,x),<dbo_A>(uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3217",
        "intermediary_question": "Whose <A> are <B> and <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_B> . ?uri <dbo_A> <dbr_C> . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_B\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "2076",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "3229",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_B\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2987",
        "intermediary_question": "What is the <A> whDe <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_A> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3297",
        "intermediary_question": "How many <A> are there of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(\"dbr_D\",x),<dbo_C>(x,uri)."
    },
    {
        "_id": "4609",
        "intermediary_question": "What is <A> <B> and <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_A> . ?uri <dbo_A> <dbr_A> . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_A\"),<dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "933",
        "intermediary_question": "Count the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbp_A> ?x  . }",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbp_A>(uri,x)."
    },
    {
        "_id": "4976",
        "intermediary_question": "How many <A> are there whose <B> is <C> and <D> is <E> ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_D> . ?uri <dbo_D> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_D\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "4614",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4232",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_D> ?x . ?x <dbp_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_D>(x,uri),<dbp_D>(\"dbr_D\",x)."
    },
    {
        "_id": "2054",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_D> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbp_D>(\"dbr_D\",x)."
    },
    {
        "_id": "3310",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "1858",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_B>(uri,x),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "3079",
        "intermediary_question": "How many <A> whose <B> is <C> and <D> is <E> are there?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "4717",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbp_B>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4922",
        "intermediary_question": "What are the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_B> . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_B\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1901",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_B> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(uri,x),<dbo_C>(x,\"dbr_B\")."
    },
    {
        "_id": "799",
        "intermediary_question": "Count the <A> in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_B> <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_A>(\"dbr_B\",uri),<dbo_A>(uri)."
    },
    {
        "_id": "54",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_B> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_E>}",
        "datalog_query": "ans(uri) :- <dbo_E>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "3335",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "3715",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_A> . ?uri <dbp_A> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_A\")."
    },
    {
        "_id": "4646",
        "intermediary_question": "Count the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_D>(x,uri)."
    }
]