[
    {
        "_id": "1912",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_E>}",
        "datalog_query": "ans(uri) :- <dbo_E>(uri),<dbp_B>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "2115",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1378",
        "intermediary_question": "What are the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_D> <dbr_C> . ?uri <dbo_D> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbo_D>(uri,\"dbr_D\"),<dbo_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "4284",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "2615",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbp_C>(\"dbr_D\",uri)."
    },
    {
        "_id": "256",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_B> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_B>(x,\"dbr_B\")."
    },
    {
        "_id": "1315",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_D> <dbp_C> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "3855",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbp_C>(uri,\"dbr_C\"),<dbp_B>(uri,\"dbr_E\"),<dbo_B>(uri)."
    },
    {
        "_id": "3133",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_C> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_A>(x,uri),<dbo_C>(x,\"dbr_C\")."
    },
    {
        "_id": "1186",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_B>(x,uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3071",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_C> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_C>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "56",
        "intermediary_question": "What is the <A> of the <B> who is the <B> of <C> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbo_B> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_C\",x),<dbp_A>(x,uri)."
    },
    {
        "_id": "2952",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_E> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_E>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3869",
        "intermediary_question": "Count the number of <A> are there whose <B> are <C> and <D>.",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_B>} ",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\"),<dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "319",
        "intermediary_question": "What is the <A> of the <B> and <A> of the <C>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_C> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_C\",uri),<dbo_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "682",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_D>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "4782",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_C>(x,uri)."
    },
    {
        "_id": "2127",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_A> <dbr_C> . ?uri <dbp_A> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_C\"),<dbp_A>(uri,\"dbr_D\")."
    },
    {
        "_id": "2771",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_A> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbo_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "1672",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_D> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "4083",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3123",
        "intermediary_question": "What <A>'s <B> is <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_C> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri,\"dbr_C\"),<dbo_C>(uri)."
    },
    {
        "_id": "2921",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_C> . ?uri <dbo_A> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_D\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "2034",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_C> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_A>(x,\"dbr_C\")."
    },
    {
        "_id": "4219",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_B\",uri),<dbp_A>(\"dbr_D\",uri)."
    },
    {
        "_id": "1017",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_B> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbo_B>(uri),<dbo_B>(x,uri)."
    },
    {
        "_id": "2656",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_B>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2135",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_B>(uri,x),<dbo_B>(uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "2815",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_D> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbp_D>(\"dbr_D\",uri)."
    },
    {
        "_id": "103",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(\"dbr_D\",x),<dbp_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "4933",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_C>(uri)."
    },
    {
        "_id": "2441",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbp_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "908",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_B> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_B>(\"dbr_D\",x)."
    },
    {
        "_id": "1522",
        "intermediary_question": "What are the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_B\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "358",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_A> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_A>(\"dbr_D\",x)."
    },
    {
        "_id": "4854",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_A> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "2955",
        "intermediary_question": "Who is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,\"dbr_D\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "4983",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <dbo_C> <dbr_C> } ",
        "datalog_query": "ans(uri) :- <dbo_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "3437",
        "intermediary_question": "Count the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_C> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_C\"),<dbo_B>(uri,x),<dbo_C>(uri)."
    },
    {
        "_id": "796",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_D>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4905",
        "intermediary_question": "How many other <A> are there of the <B> whose <C> is <D> ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_C> ?uri }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_C>(x,uri)."
    },
    {
        "_id": "3384",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_B> . ?uri <dbp_B> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_D\"),<dbp_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "3463",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbp_D> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_D>(x,\"dbr_D\"),<dbp_D>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "3467",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_A> ?x . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_D\",x),<dbo_C>(x,uri)."
    },
    {
        "_id": "442",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_D>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "4770",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1227",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,x),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3885",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_C> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_C>(uri,\"dbr_A\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "932",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "439",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "2268",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "2439",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "1893",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbo_D>(x,uri)."
    },
    {
        "_id": "4244",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_B>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "4829",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4616",
        "intermediary_question": "Who is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_A\")."
    },
    {
        "_id": "1211",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbp_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_C>(\"dbr_C\",x)."
    },
    {
        "_id": "4322",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_D> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_D>(x,uri)."
    },
    {
        "_id": "573",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_A> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "295",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbp_D> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_D>(x,\"dbr_D\"),<dbp_D>(uri,x),<dbo_D>(uri)."
    },
    {
        "_id": "2015",
        "intermediary_question": "What is the number of <A> whose <B> are <C> and <D>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_D>} ",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\"),<dbo_B>(uri,\"dbr_D\")."
    },
    {
        "_id": "4091",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1760",
        "intermediary_question": "What is the <A> of the <B> who is the <B> of <C> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbo_B> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_B>(\"dbr_C\",x)."
    },
    {
        "_id": "411",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_C>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "430",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_C>(x,uri),<dbo_C>(uri)."
    },
    {
        "_id": "2851",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_D>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "1176",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbo_C> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(uri,\"dbr_E\"),<dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "2045",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_A> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_A>(x,\"dbr_A\")."
    },
    {
        "_id": "2992",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_B>(uri,x)."
    },
    {
        "_id": "3138",
        "intermediary_question": "What is the total number of <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbp_B>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "4505",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2218",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_C>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2153",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_D>(x,\"dbr_D\"),<dbo_C>(x,uri),<dbo_C>(uri)."
    },
    {
        "_id": "2552",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbo_C>(x,uri)."
    },
    {
        "_id": "1552",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbp_D>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "4552",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?uri <dbp_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,x),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "2726",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_C>(\"dbr_D\",x),<dbp_A>(x,uri)."
    },
    {
        "_id": "652",
        "intermediary_question": "Count the number of <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_D> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_D>(uri,x),<dbo_D>(uri)."
    },
    {
        "_id": "1455",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_B>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "92",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_A> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_A\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "4824",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "1936",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_C> <dbr_C>  . }",
        "datalog_query": "ans(count) :- <dbo_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "1745",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "1185",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "1429",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_B>(uri,\"dbr_D\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4430",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_C> <dbo_B> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(\"dbr_C\",uri),<dbo_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "4194",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_E> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_E>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "658",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "437",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_C>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3100",
        "intermediary_question": "What is the <A> of the <B> who is the <A> of <C> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbo_A> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_A>(\"dbr_C\",x)."
    },
    {
        "_id": "1454",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_C\"),<dbp_D>(uri,\"dbr_E\"),<dbo_A>(uri)."
    },
    {
        "_id": "4576",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_A>(uri,x),<dbo_C>(x,\"dbr_D\")."
    }
]