[
    {
        "_id": "976",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "1299",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbp_E> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_E>(uri,\"dbr_E\"),<dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "4937",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_C> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,\"dbr_C\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "3595",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbp_B>(x,uri)."
    },
    {
        "_id": "4316",
        "intermediary_question": "What are the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_E\"),<dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "4640",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_A> ?uri. <dbr_C> <dbo_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_C\",uri),<dbo_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "3924",
        "intermediary_question": "What are the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(uri,\"dbr_B\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1226",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_D>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "4269",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_D> <dbo_D> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_D>(\"dbr_D\",uri),<dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "2906",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbp_A> ?uri. <dbr_D> <dbo_D> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_D>(\"dbr_D\",uri),<dbp_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "4301",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbp_B>(x,uri)."
    },
    {
        "_id": "1659",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3555",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2458",
        "intermediary_question": "How many <A> of the <B> whose <C> is <D>, are there ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_A> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_A\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "3781",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_A> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_B\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3355",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,x),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "141",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,x),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "3697",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(uri,x),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "1787",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2019",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "967",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbp_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,\"dbr_D\"),<dbp_A>(uri,x)."
    },
    {
        "_id": "155",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_B> ?x . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,uri),<dbo_B>(\"dbr_D\",x)."
    },
    {
        "_id": "2487",
        "intermediary_question": "How many <A> are there in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_A> <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "2535",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_D> <dbp_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_B\",uri),<dbp_B>(\"dbr_D\",uri)."
    },
    {
        "_id": "4708",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "4601",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_D>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "985",
        "intermediary_question": "How many <A> of the <B> whose <C> is <D>, are there ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3548",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_C>(uri),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3527",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_D>(x,\"dbr_D\"),<dbo_D>(x,uri)."
    },
    {
        "_id": "2692",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_B> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_B>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "268",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbo_C>(\"dbr_D\",x),<dbp_A>(x,uri)."
    },
    {
        "_id": "1967",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_A> <dbp_A> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbp_A>(\"dbr_A\",x)."
    },
    {
        "_id": "3404",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbp_B>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "773",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_A> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_A>(x,uri),<dbo_C>(x,\"dbr_A\")."
    },
    {
        "_id": "781",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbp_D>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4881",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "434",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\"),<dbo_C>(uri)."
    },
    {
        "_id": "2252",
        "intermediary_question": "Whose <A> are <B> and <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_B> . ?uri <dbo_A> <dbr_A> . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_A\"),<dbo_A>(uri,\"dbr_B\")."
    },
    {
        "_id": "965",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbp_C>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4935",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_C>(\"dbr_B\",x)."
    },
    {
        "_id": "572",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_C> <dbo_B> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_B\",uri),<dbo_B>(\"dbr_C\",uri)."
    },
    {
        "_id": "2378",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1105",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "4705",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_C>(uri)."
    },
    {
        "_id": "1251",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_A>(x,uri),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "840",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "581",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_D> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "204",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "4068",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_C> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_C>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "547",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\"),<dbo_A>(uri)."
    },
    {
        "_id": "4223",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_B>  . }",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "640",
        "intermediary_question": "List the other <A> of the <B> whose <A> is <C>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_A> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,\"dbr_A\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "4262",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_C>(\"dbr_A\",x)."
    },
    {
        "_id": "1885",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_C> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_C>(x,uri)."
    },
    {
        "_id": "1582",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "2725",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_A> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4753",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_D> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbo_D>(\"dbr_B\",uri)."
    },
    {
        "_id": "4271",
        "intermediary_question": "Count the number of <A> in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_B> <dbp_B> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_B>(\"dbr_B\",uri),<dbo_B>(uri)."
    },
    {
        "_id": "1651",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "2610",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "867",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_D>(x,\"dbr_D\")."
    },
    {
        "_id": "1337",
        "intermediary_question": "Who are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_D> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2715",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_A> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2576",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbp_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_C>(\"dbr_C\",x)."
    },
    {
        "_id": "187",
        "intermediary_question": "How many <A> are there of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(\"dbr_D\",x),<dbp_A>(x,uri)."
    },
    {
        "_id": "2085",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_D> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "4890",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_B>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "4847",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "1929",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_B>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4489",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_C>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1404",
        "intermediary_question": "What is the <A> whose <B> is <C> and <B> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_D> <dbr_C> . ?uri <dbo_D> <dbr_D>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_D\"),<dbp_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "697",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_B>(uri,x),<dbo_A>(uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2256",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_C>(x)."
    },
    {
        "_id": "2813",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "1506",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1923",
        "intermediary_question": "Who is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "4128",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_A> <dbr_C> . ?uri <dbp_A> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_D\"),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "3880",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_A> <dbr_C>  . }",
        "datalog_query": "ans(count) :- <dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "1653",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_C>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1430",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",x),<dbo_D>(x,uri)."
    },
    {
        "_id": "234",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbp_D>(x,\"dbr_D\")."
    },
    {
        "_id": "2283",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "662",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "2503",
        "intermediary_question": "How many <A> of the <B> whose <C> is <D>, are there ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_B>(x,uri)."
    },
    {
        "_id": "4835",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "487",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "521",
        "intermediary_question": "Who are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "3477",
        "intermediary_question": "Who is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4997",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbo_B>(uri,x)."
    },
    {
        "_id": "118",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbp_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4343",
        "intermediary_question": "Who are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,x),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "2699",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbp_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "4267",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    }
]