[
    {
        "_id": "1501",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_C>  . }",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2586",
        "intermediary_question": "What <A>'s <B> is <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_C> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "2653",
        "intermediary_question": "What is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1055",
        "intermediary_question": "What is the <A> of <B> ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri } ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "705",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "106",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "589",
        "intermediary_question": "What is the <A> of <B> ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri } ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2468",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2413",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2464",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",x),<dbo_A>(x,uri)."
    },
    {
        "_id": "228",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_C>  . }",
        "datalog_query": "ans(count) :- <dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "915",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "3021",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3543",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbp_D>(x,\"dbr_D\")."
    },
    {
        "_id": "1073",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "3351",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_C> <dbo_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_C\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "1744",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "926",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "1117",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> } ",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "642",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "4767",
        "intermediary_question": "What is the total number of other <A> of the <B> whose <A> is <C>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_C> . ?x <dbo_A> ?uri }",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_C\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "4066",
        "intermediary_question": "Who is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbo_D> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_D>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "333",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_D> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "4684",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "486",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_B>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "393",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_C>(x)."
    },
    {
        "_id": "4842",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_C> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbo_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "4866",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1755",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2515",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4315",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "4966",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2099",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "3599",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "29",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbo_C>(\"dbr_D\",uri)."
    },
    {
        "_id": "3773",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbp_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4635",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_C> ?uri. <dbr_C> <dbo_C> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_C\",uri),<dbo_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "3161",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_A> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_A\")."
    },
    {
        "_id": "2659",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4615",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4628",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2451",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2846",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "3078",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_A> <dbr_A>  . }",
        "datalog_query": "ans(count) :- <dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "1103",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_D> <dbo_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_D\",uri),<dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "168",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "1670",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2377",
        "intermediary_question": "What are the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_E>}",
        "datalog_query": "ans(uri) :- <dbo_E>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4395",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_C> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbp_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "4257",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "23",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_B>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2633",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "2215",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbo_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "3682",
        "intermediary_question": "What are the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_D\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1907",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C> . ?uri <dbp_A> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,\"dbr_E\"),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "84",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "1001",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_D> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_D>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2138",
        "intermediary_question": "Who are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "711",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbp_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_C\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2527",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_D> <dbo_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_D\",uri),<dbo_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "3752",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> } ",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3181",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "3024",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_C\"),<dbp_B>(uri,\"dbr_D\")."
    },
    {
        "_id": "1413",
        "intermediary_question": "Count the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_B>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "655",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "4797",
        "intermediary_question": "Who are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C>  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "3849",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "4153",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbo_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "1295",
        "intermediary_question": "List the other <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_C>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "497",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "4740",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "3456",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "373",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "1669",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "2131",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_D>(x,\"dbr_D\")."
    },
    {
        "_id": "4439",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "465",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "248",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "931",
        "intermediary_question": "What is the <A> whose <B> is <C>?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_B> } ",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "1335",
        "intermediary_question": "Whose <A> are <B> and <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_B> . ?uri <dbo_A> <dbr_C> . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_C\"),<dbo_A>(uri,\"dbr_B\")."
    },
    {
        "_id": "1406",
        "intermediary_question": "What <A>'s <B> is <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4209",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "742",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_D> . ?uri <dbo_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_D\")."
    },
    {
        "_id": "2323",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "240",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbp_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_D>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "1370",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "2280",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "4256",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_A>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_A>(x)."
    },
    {
        "_id": "3107",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_C>(x,\"dbr_D\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "1973",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "1375",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_B\",uri),<dbo_C>(\"dbr_D\",uri)."
    },
    {
        "_id": "4062",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "179",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3698",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbo_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbo_A>(\"dbr_D\",uri)."
    },
    {
        "_id": "4878",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_A> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2974",
        "intermediary_question": "How many other <A> are there of the <B> whose <A> is <C> ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_A> . ?x <dbo_A> ?uri }",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_A\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "2887",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "4673",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    }
]