[
    {
        "_id": "1175",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_B>(uri,x)."
    },
    {
        "_id": "410",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4212",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_C\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3429",
        "intermediary_question": "What are the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_B> <dbr_A> . ?uri <dbo_B> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_D\"),<dbo_B>(uri,\"dbr_A\")."
    },
    {
        "_id": "2809",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "2836",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_C> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_C\")."
    },
    {
        "_id": "2372",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_D>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2146",
        "intermediary_question": "Who is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_C> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4975",
        "intermediary_question": "What is the <A> whose <B> is <C> and which is a <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_A> <dbr_D>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_D\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "721",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_E>}",
        "datalog_query": "ans(uri) :- <dbo_E>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4410",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2845",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,x),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "2053",
        "intermediary_question": "List the other <A> of the <B> whose <A> is <C>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_C> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,\"dbr_C\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "4613",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_B>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2609",
        "intermediary_question": "What is the <A> of the <B> and <A> of the <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_A> <dbo_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_A\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "4415",
        "intermediary_question": "What is the total number of <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\"),<dbp_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "812",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_D> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_D>(\"dbr_D\",x)."
    },
    {
        "_id": "1258",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_D> <dbp_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_D\",uri),<dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "3316",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "3574",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4811",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbo_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2964",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2672",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_C\"),<dbo_B>(uri)."
    },
    {
        "_id": "561",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2778",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2817",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_C> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbp_A>(x,\"dbr_C\")."
    },
    {
        "_id": "2758",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbp_C>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "1588",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "3347",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,\"dbr_D\"),<dbo_A>(uri,x)."
    },
    {
        "_id": "3001",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "210",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "949",
        "intermediary_question": "Count the <A> in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_B> <dbp_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "3716",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_D> <dbo_C> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbo_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "1360",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_C> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbo_C>(x,\"dbr_C\")."
    },
    {
        "_id": "2004",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_B\",uri),<dbp_C>(\"dbr_D\",uri)."
    },
    {
        "_id": "478",
        "intermediary_question": "How many other <A> are there of the <B> whose <A> is <C> ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_C> . ?x <dbp_B> ?uri }",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_C\"),<dbp_B>(x,uri)."
    },
    {
        "_id": "4112",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(uri,x),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "2170",
        "intermediary_question": "Who is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_C> . ?uri <dbo_A> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_D\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "322",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C> . ?uri <dbp_A> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_E\"),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "4254",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri)."
    },
    {
        "_id": "533",
        "intermediary_question": "What is the total number of <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_D> . ?uri <dbo_D> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbp_B>(uri,\"dbr_D\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "2932",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_C> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_A>(x,\"dbr_C\")."
    },
    {
        "_id": "4534",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_E\"),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "3360",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "4005",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_D\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2423",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_D\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3240",
        "intermediary_question": "Who is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "2111",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_C> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_C>(\"dbr_D\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "1174",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_C> ?uri. <dbr_C> <dbp_C> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_C\",uri),<dbp_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "4862",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_A> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "3811",
        "intermediary_question": "What are the other <A> of the <B> whose <C> is <D>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_A> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_A>(x,\"dbr_A\")."
    },
    {
        "_id": "4885",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_C>(uri)."
    },
    {
        "_id": "2416",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_C\"),<dbp_B>(uri,\"dbr_E\")."
    },
    {
        "_id": "70",
        "intermediary_question": "What are the other <A> of the <B> whose <C> is <D>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_C>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4880",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_C> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "4024",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_E> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_E>(uri,\"dbr_C\")."
    },
    {
        "_id": "1095",
        "intermediary_question": "What are the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_A> . ?uri <dbo_A> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_D\"),<dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "4545",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_D> <dbo_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_B\",uri),<dbo_A>(\"dbr_D\",uri)."
    },
    {
        "_id": "1212",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "1425",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "4519",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_A> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "4581",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbp_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbp_A>(\"dbr_C\",uri)."
    },
    {
        "_id": "1025",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "1876",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "4299",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "1192",
        "intermediary_question": "What are the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_B> . ?uri <dbo_D> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_B\"),<dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "3670",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_A> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_A\")."
    },
    {
        "_id": "624",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_A> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4291",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "4968",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C> . ?uri <dbp_D> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_A\"),<dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "233",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4566",
        "intermediary_question": "How many <A> whose <B>'s <C> is <D> are there?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "4246",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_C>(\"dbr_D\",x),<dbo_C>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "746",
        "intermediary_question": "What is <A> of the <B> who is the <C> of <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D>  <dbp_C> ?x .  ?x <dbp_C> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_C>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "1200",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_C> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_C>(x,\"dbr_C\")."
    },
    {
        "_id": "3253",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3226",
        "intermediary_question": "Who is the <A> whose <B> is <C>?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> } ",
        "datalog_query": "ans(uri) :- <dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "1412",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "1965",
        "intermediary_question": "Who is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,x),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "371",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_C> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_C\")."
    },
    {
        "_id": "1340",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_A> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_A\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "810",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4324",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_A> <dbp_A> ?uri. <dbr_C> <dbp_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_A\",uri),<dbp_A>(\"dbr_C\",uri)."
    },
    {
        "_id": "4190",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",x),<dbo_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "751",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_B>(uri),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4644",
        "intermediary_question": "How many <A> are there in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_B> <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_A>(\"dbr_B\",uri),<dbo_A>(uri)."
    },
    {
        "_id": "2531",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2297",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_A> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_A>(\"dbr_D\",x)."
    },
    {
        "_id": "51",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_D>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "534",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_C> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbp_C>(uri,\"dbr_C\"),<dbo_C>(uri)."
    },
    {
        "_id": "1945",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(x,uri),<dbo_C>(\"dbr_D\",x)."
    },
    {
        "_id": "3002",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_D> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_E\"),<dbo_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "1432",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_D> ?x . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,uri),<dbo_D>(\"dbr_D\",x)."
    }
]