[
    {
        "_id": "1307",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbo_D> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_D>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "4455",
        "intermediary_question": "What is the <A> whCe <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(x,\"dbr_D\"),<dbo_B>(uri,x)."
    },
    {
        "_id": "1993",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_A> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_A\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2639",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_B> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_B>(x,\"dbr_B\")."
    },
    {
        "_id": "3081",
        "intermediary_question": "How many <A> whose <B> is <C> and <D> is <E> are there?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_A> <dbr_A> } ",
        "datalog_query": "ans(count) :- <dbp_B>(uri,\"dbr_C\"),<dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "2966",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "380",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_D> <dbr_A> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_D>(uri,\"dbr_A\")."
    },
    {
        "_id": "2381",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "4198",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "4874",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3513",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_B>(uri),<dbp_B>(uri,x)."
    },
    {
        "_id": "1230",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_A> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_C>(x,\"dbr_A\")."
    },
    {
        "_id": "4670",
        "intermediary_question": "What are the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_D> <dbr_C> . ?uri <dbp_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,\"dbr_E\"),<dbp_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "4979",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_B> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3061",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_A>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "4472",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbo_A> <dbr_C>  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_C\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "409",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "3408",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "458",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "3471",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_A> ?uri. <dbr_D> <dbo_D> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_D>(\"dbr_D\",uri),<dbo_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "3657",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_D> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,\"dbr_C\"),<dbp_D>(uri,\"dbr_E\"),<dbo_A>(uri)."
    },
    {
        "_id": "4805",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbp_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_B>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "4699",
        "intermediary_question": "Who are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_A>  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "105",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3412",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbp_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "2636",
        "intermediary_question": "Count the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_D> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbo_D>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "4290",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,uri),<dbo_C>(uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2720",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_D> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbp_D>(\"dbr_B\",uri)."
    },
    {
        "_id": "1109",
        "intermediary_question": "Give the total number of <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "591",
        "intermediary_question": "How many <A> are there of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(\"dbr_D\",x),<dbp_A>(x,uri),<dbo_A>(x)."
    },
    {
        "_id": "1343",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_E> <dbr_C> . ?uri <dbo_E> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_E>(uri,\"dbr_E\"),<dbo_E>(uri,\"dbr_C\")."
    },
    {
        "_id": "583",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_A> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_A\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4407",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbo_C> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_A>(\"dbr_B\",uri),<dbo_C>(\"dbr_D\",uri)."
    },
    {
        "_id": "3532",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,x),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "1559",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbp_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_C>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "2477",
        "intermediary_question": "How many <A> whose <B> is <C> and <D> is <E> are there?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_D> <dbr_E> } ",
        "datalog_query": "ans(count) :- <dbp_B>(uri,\"dbr_C\"),<dbp_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "4114",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbp_A>(x,\"dbr_D\"),<dbo_D>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "4757",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_D>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_D>(uri,\"dbr_D\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3233",
        "intermediary_question": "What is the total number of other <A> of the <B> whose <A> is <C>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_C> . ?x <dbp_A> ?uri }",
        "datalog_query": "ans(count) :- <dbp_A>(x,uri),<dbp_A>(x,\"dbr_C\")."
    },
    {
        "_id": "3908",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "1562",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "3093",
        "intermediary_question": "What is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "1098",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "3971",
        "intermediary_question": "Give me the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_B> <dbr_D> . ?x <dbp_C> ?uri }",
        "datalog_query": "ans(count) :- <dbp_C>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "4055",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_C> ?uri. <dbr_C> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_C\",uri),<dbp_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "686",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_C> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_C>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2752",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_C>(\"dbr_D\",x),<dbp_A>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "3395",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "1219",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_D> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,\"dbr_C\"),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri)."
    },
    {
        "_id": "3930",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_B> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_B>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "447",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_C> <dbp_B> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_B\",uri),<dbp_B>(\"dbr_C\",uri)."
    },
    {
        "_id": "588",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_C> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_E\"),<dbo_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "3966",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_D>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "4712",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_D> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_D>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "3935",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_A> <dbr_C> . ?uri <dbp_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,\"dbr_E\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "3796",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_B>(uri,\"dbr_D\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2271",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_C> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1137",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_B>(x,uri)."
    },
    {
        "_id": "37",
        "intermediary_question": "What is the <A> of the <B> who is the <B> of <C> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbp_B> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_B>(\"dbr_C\",x)."
    },
    {
        "_id": "3195",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbp_D>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "1418",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,x),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "1290",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "2",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbo_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_C>(\"dbr_C\",x)."
    },
    {
        "_id": "2737",
        "intermediary_question": "Who is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "1596",
        "intermediary_question": "What is the <A> whose <B> is <C> and <B> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_A> . ?uri <dbp_B> <dbr_D>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_D\"),<dbo_B>(uri,\"dbr_A\")."
    },
    {
        "_id": "824",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_A> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_A\"),<dbp_A>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "1389",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_C> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,\"dbr_C\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "1607",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_D> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "2273",
        "intermediary_question": "How many other <A> are there of the <B> whose <A> is <C> ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_A> . ?x <dbp_A> ?uri }",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_A\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "1085",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_C> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_C>(\"dbr_A\",x)."
    },
    {
        "_id": "806",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_C>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4235",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_C> . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_C>(x,uri),<dbp_C>(x,\"dbr_C\")."
    },
    {
        "_id": "2234",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_C> ?uri. <dbr_C> <dbo_C> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_C>(\"dbr_C\",uri),<dbo_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "4378",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "339",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "3487",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_C> . ?uri <dbo_A> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_A>(uri,\"dbr_D\"),<dbo_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "250",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x),<dbo_C>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "4919",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_C>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "15",
        "intermediary_question": "Give me a count of <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_A>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_A\"),<dbo_A>(uri)."
    },
    {
        "_id": "3042",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_C>(x,\"dbr_D\"),<dbo_A>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "4856",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_A> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_A\"),<dbo_A>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "2930",
        "intermediary_question": "What are the other <A> of the <B> whose <C> is <D>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "4387",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_A>(x,uri),<dbo_A>(uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4799",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_D> <dbr_C> . ?uri <dbo_D> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_D\"),<dbo_A>(uri)."
    },
    {
        "_id": "4982",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",x),<dbo_B>(x,uri)."
    },
    {
        "_id": "3663",
        "intermediary_question": "What are the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_B> . ?uri <dbp_D> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_B\"),<dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "3640",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_D> ?uri. <dbr_D> <dbo_D> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_D>(\"dbr_D\",uri),<dbp_D>(\"dbr_B\",uri)."
    },
    {
        "_id": "3937",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(\"dbr_D\",x),<dbo_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "4427",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_A> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbo_A>(x,\"dbr_A\")."
    },
    {
        "_id": "2864",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "107",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_C> . ?uri <dbp_C> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_C>(uri,x),<dbp_C>(x,\"dbr_C\")."
    },
    {
        "_id": "1240",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_C> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,\"dbr_C\"),<dbo_B>(uri,\"dbr_C\")."
    }
]