[
    {
        "_id": "4200",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2052",
        "intermediary_question": "How many <A> are there whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE {?uri <dbo_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_B>(uri,\"dbr_C\"),<dbo_B>(uri)."
    },
    {
        "_id": "2460",
        "intermediary_question": "List the other <A> of the <B> whose <A> is <C>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_C> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbo_A>(x,\"dbr_C\")."
    },
    {
        "_id": "1954",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_D\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "184",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "511",
        "intermediary_question": "How many <A> of the <B> whose <C> is <D>, are there ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_C> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_C\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "4773",
        "intermediary_question": "How many <A> are there in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_B> <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "3559",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_C\"),<dbp_D>(uri,\"dbr_E\"),<dbo_A>(uri)."
    },
    {
        "_id": "4011",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_B>(x,uri)."
    },
    {
        "_id": "122",
        "intermediary_question": "Give the total number of <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbp_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3333",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_C>(x,uri),<dbp_D>(x,\"dbr_D\")."
    },
    {
        "_id": "567",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_C> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_A>(x,\"dbr_C\")."
    },
    {
        "_id": "3185",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(\"dbr_D\",x),<dbo_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "720",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3822",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "4892",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_C>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "896",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_C> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbo_A>(x,\"dbr_C\")."
    },
    {
        "_id": "2347",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_A> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_A>(\"dbr_D\",x)."
    },
    {
        "_id": "3439",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "298",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_D>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "2119",
        "intermediary_question": "What are the other <A> of the <B> whose <C> is <D>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbo_C>(x,uri),<dbo_C>(x)."
    },
    {
        "_id": "2536",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_E> <dbr_C> . ?uri <dbp_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,\"dbr_E\"),<dbp_E>(uri,\"dbr_C\")."
    },
    {
        "_id": "1260",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(x,\"dbr_D\"),<dbo_B>(uri,x)."
    },
    {
        "_id": "2905",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "1870",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_D>(uri,\"dbr_B\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3853",
        "intermediary_question": "What is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "3616",
        "intermediary_question": "How many <A> are there of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbp_D> ?x . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_D>(\"dbr_D\",x),<dbo_D>(x,uri)."
    },
    {
        "_id": "378",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_C> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_C>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3927",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_B> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbo_B>(\"dbr_D\",x)."
    },
    {
        "_id": "3259",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_D>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4663",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "3409",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "2829",
        "intermediary_question": "What is the <A> of the <B> which is the <B> of <C> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbo_B> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_C\",x),<dbp_A>(x,uri),<dbo_B>(x)."
    },
    {
        "_id": "1168",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_C\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3165",
        "intermediary_question": "What is the <A> of the <B> and <A> of the <C>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbp_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbp_B>(\"dbr_C\",uri)."
    },
    {
        "_id": "3575",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "2305",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3053",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4559",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_A> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_A>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "1209",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbp_C>(x,\"dbr_D\"),<dbp_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "3545",
        "intermediary_question": "What is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "1921",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_A>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "308",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4038",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_C> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_C\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "4846",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_C>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1746",
        "intermediary_question": "Who is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_D> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbo_D>(\"dbr_B\",uri)."
    },
    {
        "_id": "19",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1487",
        "intermediary_question": "Give the total number of <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "438",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbp_A>(\"dbr_D\",uri)."
    },
    {
        "_id": "2750",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_C> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",uri),<dbo_C>(\"dbr_B\",uri)."
    },
    {
        "_id": "3433",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbp_A>(x,uri),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "3688",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbp_A>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "802",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",x),<dbp_A>(x,uri)."
    },
    {
        "_id": "2997",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "4346",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "1583",
        "intermediary_question": "What is the total number of other <A> of the <B> whose <A> is <C>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_C> . ?x <dbo_A> ?uri }",
        "datalog_query": "ans(count) :- <dbo_A>(x,uri),<dbo_A>(x,\"dbr_C\")."
    },
    {
        "_id": "3026",
        "intermediary_question": "Who is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_C\"),<dbo_A>(uri)."
    },
    {
        "_id": "4453",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_C>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3192",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4440",
        "intermediary_question": "What <A>'s <B> is <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4858",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "214",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_A> ?uri. <dbr_D> <dbo_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_D\",uri),<dbo_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "879",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_D> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_D>(x,uri)."
    },
    {
        "_id": "568",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_A> <dbr_B>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,\"dbr_B\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4181",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_C>(\"dbr_B\",x)."
    },
    {
        "_id": "4023",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_C> <dbo_A> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbo_A>(\"dbr_B\",uri),<dbo_A>(\"dbr_C\",uri)."
    },
    {
        "_id": "2059",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3043",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1569",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_C>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3624",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbo_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_C>(uri,\"dbr_E\"),<dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "1786",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_A> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_A>(\"dbr_D\",x)."
    },
    {
        "_id": "88",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "457",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_B> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_B>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "1305",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,x),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "2925",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "3270",
        "intermediary_question": "How many <A> are there of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_D> <dbp_A> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_A>(\"dbr_D\",x),<dbo_A>(x,uri)."
    },
    {
        "_id": "3022",
        "intermediary_question": "Count the number of <A> in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_B> <dbp_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2775",
        "intermediary_question": "What are the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_C> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "4849",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "4793",
        "intermediary_question": "What is the <A> of the <B> and <A> of the <C>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_C> <dbp_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_C\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2776",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_C> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_C>(uri,x),<dbo_A>(uri)."
    },
    {
        "_id": "2970",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_B>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_E\")."
    },
    {
        "_id": "1743",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_A> <dbo_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_A\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "2274",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_A> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4245",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_C> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "1784",
        "intermediary_question": "What is the <A> of <B> ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbp_A> ?uri } ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "1779",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "4900",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_E>}",
        "datalog_query": "ans(uri) :- <dbo_E>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3770",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "1024",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_B> . ?uri <dbp_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "2473",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2512",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbo_B>(uri,x)."
    },
    {
        "_id": "4822",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_A> . ?uri <dbo_A> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_A>(uri,x),<dbp_C>(x,\"dbr_A\")."
    },
    {
        "_id": "937",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_A> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbo_A>(\"dbr_A\",uri)."
    }
]