[
    {
        "_id": "309",
        "intermediary_question": "Give the total number of <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_C> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_C\"),<dbp_B>(uri,x)."
    },
    {
        "_id": "3830",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "305",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "843",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_D>(x,\"dbr_D\"),<dbo_B>(x,uri)."
    },
    {
        "_id": "3872",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_C> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_D\",x),<dbp_C>(x,uri)."
    },
    {
        "_id": "4354",
        "intermediary_question": "Whose <A> are <B> and <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_A> <dbr_B> . ?uri <dbp_A> <dbr_C> . }",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,\"dbr_C\"),<dbp_A>(uri,\"dbr_B\")."
    },
    {
        "_id": "680",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "278",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_C>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3683",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_D> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_D\")."
    },
    {
        "_id": "3631",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_B>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2174",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x,\"dbr_D\"),<dbo_A>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "1862",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4075",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_D> <dbp_B> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_B\",uri),<dbp_B>(\"dbr_D\",uri)."
    },
    {
        "_id": "2157",
        "intermediary_question": "How many other <A> are there of the <B> whose <A> is <C> ?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_C> . ?x <dbp_C> ?uri }",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_C\"),<dbp_C>(x,uri)."
    },
    {
        "_id": "111",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_C\"),<dbp_B>(uri,\"dbr_D\"),<dbo_A>(uri)."
    },
    {
        "_id": "627",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_D> ?x . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_D>(\"dbr_D\",x)."
    },
    {
        "_id": "198",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbo_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,x),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "402",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_D> <dbr_C> . ?uri <dbp_D> <dbr_D> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_D>(uri,\"dbr_D\"),<dbp_D>(uri,\"dbr_C\")."
    },
    {
        "_id": "4999",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_C> ?uri. <dbr_D> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_B\",uri),<dbp_C>(\"dbr_D\",uri)."
    },
    {
        "_id": "1897",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_C> . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(x,uri),<dbp_C>(x,\"dbr_C\")."
    },
    {
        "_id": "3950",
        "intermediary_question": "What is the <A> of the <B> and <A> of the <C>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_C\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "4575",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2244",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_C> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",x),<dbo_A>(x,uri)."
    },
    {
        "_id": "494",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_B> . ?x <dbp_B> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_B\"),<dbp_B>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "2402",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_B>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "618",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_B> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_A>(x,uri),<dbp_B>(x,\"dbr_B\")."
    },
    {
        "_id": "1697",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_C>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "3593",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbp_D>(x,\"dbr_D\")."
    },
    {
        "_id": "2073",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1042",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbp_C> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(uri,x),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3252",
        "intermediary_question": "What are the other <A> of the <B> whose <A> is <C>>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_C> . ?x <dbo_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_C>(x,uri),<dbo_C>(x,\"dbr_C\")."
    },
    {
        "_id": "1438",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_D> ?x . ?x <dbp_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(\"dbr_D\",x),<dbp_A>(x,uri)."
    },
    {
        "_id": "3603",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_D>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "4593",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_B> ?uri. <dbr_C> <dbo_B> ?uri . }",
        "datalog_query": "ans(uri) :- <dbo_B>(\"dbr_C\",uri),<dbo_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "3694",
        "intermediary_question": "What is the <A> of the <B> who is the <B> of <C> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_C> <dbp_B> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(\"dbr_C\",x),<dbo_A>(x,uri)."
    },
    {
        "_id": "3667",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_B>(uri,x),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "1630",
        "intermediary_question": "How many <A> are there whose <B>'s <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_C>(uri)."
    },
    {
        "_id": "3554",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_C>(x,uri),<dbo_D>(uri)."
    },
    {
        "_id": "3265",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbo_A> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_B\",uri),<dbo_A>(\"dbr_D\",uri)."
    },
    {
        "_id": "4697",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_D> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_D>(x,uri),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "360",
        "intermediary_question": "Who is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_B> <dbr_C> . ?uri <dbo_B> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_C\"),<dbo_B>(uri,\"dbr_D\")."
    },
    {
        "_id": "4141",
        "intermediary_question": "What is the <A> of <B> ?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_A> <dbo_A> ?uri } ",
        "datalog_query": "ans(uri) :- <dbo_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "2478",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "4214",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_B> ?uri. <dbr_D> <dbo_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbo_C>(\"dbr_D\",uri),<dbp_B>(\"dbr_B\",uri)."
    },
    {
        "_id": "4180",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_D>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4884",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbp_B> <dbr_C> . ?uri <dbp_B> <dbr_B> . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbp_B>(uri,\"dbr_B\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "490",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_A>(x,\"dbr_D\"),<dbp_A>(x,uri)."
    },
    {
        "_id": "4099",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4385",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbo_A>(x,\"dbr_D\")."
    },
    {
        "_id": "506",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbo_B> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbo_B>(x,uri),<dbp_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1905",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "433",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbp_A> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "3162",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "1102",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_A> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,x),<dbp_A>(x,\"dbr_D\")."
    },
    {
        "_id": "615",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_B> . ?uri <dbo_D> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_B\")."
    },
    {
        "_id": "643",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbp_C> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(x),<dbp_C>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "1068",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_C> ?x . ?x <dbo_D> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(x,uri),<dbp_C>(\"dbr_D\",x)."
    },
    {
        "_id": "622",
        "intermediary_question": "What is the number of <A> whose <B> are <C> and <D>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?uri <dbo_A> <dbr_C> . ?uri <dbo_A> <dbr_D>} ",
        "datalog_query": "ans(count) :- <dbo_A>(uri,\"dbr_C\"),<dbo_A>(uri,\"dbr_D\")."
    },
    {
        "_id": "1595",
        "intermediary_question": "What is the <A> of the <B> which is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbo_D> ?x . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(x,uri),<dbo_D>(\"dbr_D\",x)."
    },
    {
        "_id": "4173",
        "intermediary_question": "Count the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_D> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_A>(x,uri),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "518",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbp_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(uri) :- <dbo_B>(uri),<dbp_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "1157",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(uri),<dbo_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "3755",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_A> <dbp_A> ?uri. <dbr_C> <dbp_A> ?uri . }",
        "datalog_query": "ans(uri) :- <dbp_A>(\"dbr_C\",uri),<dbp_A>(\"dbr_A\",uri)."
    },
    {
        "_id": "3493",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_A> . ?uri <dbp_A> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,x),<dbo_C>(x,\"dbr_A\")."
    },
    {
        "_id": "540",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_C> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_C>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "2567",
        "intermediary_question": "How many <A> are there whose <B> are <C> and <D>?",
        "sparql_query": " SELECT DISTINCT COUNT(?uri) WHERE { ?uri <dbo_D> <dbr_C> . ?uri <dbo_D> <dbr_D>} ",
        "datalog_query": "ans(count) :- <dbo_D>(uri,\"dbr_C\"),<dbo_D>(uri,\"dbr_D\")."
    },
    {
        "_id": "1932",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_A> <dbr_D> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_A>(x,\"dbr_D\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "564",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_B> <dbr_D> . ?x <dbo_B> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_B>(x,\"dbr_D\"),<dbo_B>(x,uri)."
    },
    {
        "_id": "1471",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbo_B>(x,\"dbr_D\"),<dbo_B>(uri,x),<dbo_B>(uri)."
    },
    {
        "_id": "4207",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbp_B> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbp_B>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1051",
        "intermediary_question": "List the <A> whose <B>'s <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_B>(uri,x),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "4721",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbp_C> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_C>(\"dbr_C\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "4529",
        "intermediary_question": "List the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_B> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbp_B>(x,\"dbr_D\")."
    },
    {
        "_id": "1593",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_C> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbo_D>(x),<dbo_A>(x,uri),<dbo_C>(x,\"dbr_D\")."
    },
    {
        "_id": "2547",
        "intermediary_question": "What is the total number of <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?uri <dbo_C> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbo_C>(uri,x),<dbo_C>(uri)."
    },
    {
        "_id": "1023",
        "intermediary_question": "What is the <A> of the <B> who is the <C> of <D> ?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_D> <dbp_B> ?x . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(uri) :- <dbo_A>(x,uri),<dbp_B>(\"dbr_D\",x)."
    },
    {
        "_id": "4988",
        "intermediary_question": "Who is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_C> <dbr_C>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(uri) :- <dbo_C>(uri),<dbo_C>(uri,\"dbr_C\")."
    },
    {
        "_id": "2850",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_D>}",
        "datalog_query": "ans(uri) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_D>(x)."
    },
    {
        "_id": "4895",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_B> . ?x <dbo_A> ?uri  . }",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_B\"),<dbo_A>(x,uri)."
    },
    {
        "_id": "1514",
        "intermediary_question": "What is the total number of <A> of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_B> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_B>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "3914",
        "intermediary_question": "What is the <A> whose <B> are <C> and <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?uri <dbo_A> <dbr_A> . ?uri <dbo_A> <dbr_D> . }",
        "datalog_query": "ans(uri) :- <dbo_A>(uri,\"dbr_D\"),<dbo_A>(uri,\"dbr_A\")."
    },
    {
        "_id": "1106",
        "intermediary_question": "Count the number of <A> in <B>?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { <dbr_B> <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_A>(\"dbr_B\",uri),<dbo_B>(uri)."
    },
    {
        "_id": "1789",
        "intermediary_question": "Who is the <A> whose <B> is <C>?",
        "sparql_query": " SELECT DISTINCT ?uri WHERE {?uri <dbp_A> <dbr_C> } ",
        "datalog_query": "ans(uri) :- <dbp_A>(uri,\"dbr_C\")."
    },
    {
        "_id": "2063",
        "intermediary_question": "What is the <A> of the <B> and <C>",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { <dbr_B> <dbp_A> ?uri. <dbr_C> <dbp_A> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbp_A>(\"dbr_C\",uri),<dbp_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "817",
        "intermediary_question": "What is the <A> of the <B> whose <C> is <D>>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbp_D> <dbr_D> . ?x <dbo_A> ?uri  . ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(x),<dbo_A>(x,uri),<dbp_D>(x,\"dbr_D\")."
    },
    {
        "_id": "208",
        "intermediary_question": "How many <A> are there, of the <B> whose <C> is <D> ?",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_C> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_C>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_C>(x,uri),<dbo_C>(uri)."
    },
    {
        "_id": "1616",
        "intermediary_question": "What are the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_D> <dbr_D> . ?uri <dbp_D> ?x  . }",
        "datalog_query": "ans(uri) :- <dbp_D>(uri,x),<dbo_D>(x,\"dbr_D\")."
    },
    {
        "_id": "1228",
        "intermediary_question": "Who is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_B> <dbr_D> . ?uri <dbo_B> ?x  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,x),<dbo_B>(x,\"dbr_D\")."
    },
    {
        "_id": "4353",
        "intermediary_question": "What is the <A> of the <B> and <C> of the <D>",
        "sparql_query": " SELECT DISTINCT ?uri WHERE { <dbr_B> <dbo_A> ?uri. <dbr_D> <dbp_D> ?uri} ",
        "datalog_query": "ans(uri) :- <dbp_D>(\"dbr_D\",uri),<dbo_A>(\"dbr_B\",uri)."
    },
    {
        "_id": "4683",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_C> . ?uri <dbo_C> <dbr_E>  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_C>(uri,\"dbr_E\"),<dbo_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "1097",
        "intermediary_question": "What is the <A> whose <B> is <C> and <D> is <E>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbp_B> <dbr_C> . ?uri <dbo_D> <dbr_E>  . }",
        "datalog_query": "ans(uri) :- <dbo_D>(uri,\"dbr_E\"),<dbp_B>(uri,\"dbr_C\")."
    },
    {
        "_id": "4718",
        "intermediary_question": "What is the <A> whose <B> is <C>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE {?uri <dbo_B> <dbr_A>  . }",
        "datalog_query": "ans(uri) :- <dbo_B>(uri,\"dbr_A\")."
    },
    {
        "_id": "183",
        "intermediary_question": "Give the total number of <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbp_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_B>}",
        "datalog_query": "ans(count) :- <dbp_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_B>(uri)."
    },
    {
        "_id": "3563",
        "intermediary_question": "Count the <A> of the <B> whose <C> is <D>.",
        "sparql_query": "SELECT DISTINCT COUNT(?uri) WHERE { ?x <dbo_C> <dbr_D> . ?x <dbp_A> ?uri  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(count) :- <dbo_C>(x,\"dbr_D\"),<dbp_A>(x,uri),<dbo_A>(uri)."
    },
    {
        "_id": "1837",
        "intermediary_question": "What is the <A> whose <B>'s <C> is <D>?",
        "sparql_query": "SELECT DISTINCT ?uri WHERE { ?x <dbo_A> <dbr_A> . ?uri <dbo_B> ?x  . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <dbo_A>}",
        "datalog_query": "ans(uri) :- <dbo_A>(uri),<dbo_B>(uri,x),<dbo_A>(x,\"dbr_A\")."
    }
]